# IsTemporaryViewPropertiesModeEnabled Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsTemporaryViewPropertiesModeEnabled Method
View Class See Also
---
Returns true when Temporary View Properties mode is in progress, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsTemporaryViewPropertiesModeEnabled()
```

Visual Basic
---
```text
Public Function IsTemporaryViewPropertiesModeEnabled As Boolean
```

Visual C++
---
```text
public:
bool IsTemporaryViewPropertiesModeEnabled()
```

# See Also
View Class
Autodesk.Revit.DB Namespace